### 딕셔너리 활용하여 데이터프레임생성

In [117]:
import pandas as pd
from itertools import repeat
a = ["A01","A02","A03","A04","A05"]
b = list(range(201501,201506,1))
c = list(repeat(100,5))
my_dict = dict(col1=a,col2=b,col3=c)
testdf = pd.DataFrame(my_dict)
testdf

  col1    col2  col3
0  A01  201501   100
1  A02  201502   100
2  A03  201503   100
3  A04  201504   100
4  A05  201505   100

In [118]:
sortedData = testdf.sort_values(by=["col3"], ascending=False)
sortedData2 = sortedData.reset_index(drop=True)
sortedData2["rank_col3"] = sortedData2["col3"].rank(ascending=False)
sortedData2

  col1    col2  col3  rank_col3
0  A01  201501   100        3.0
1  A02  201502   100        3.0
2  A03  201503   100        3.0
3  A04  201504   100        3.0
4  A05  201505   100        3.0

In [120]:
list(range(1,6))

[1, 2, 3, 4, 5]

In [121]:
sortedData2

  col1    col2  col3  rank_col3
0  A01  201501   100        3.0
1  A02  201502   100        3.0
2  A03  201503   100        3.0
3  A04  201504   100        3.0
4  A05  201505   100        3.0

In [122]:
sortedData2.reset_index()

   index col1    col2  col3  rank_col3
0      0  A01  201501   100        3.0
1      1  A02  201502   100        3.0
2      2  A03  201503   100        3.0
3      3  A04  201504   100        3.0
4      4  A05  201505   100        3.0

In [123]:
newdf = sortedData2.reindex(index=list(range(1,6)))
newdf

  col1      col2   col3  rank_col3
1  A02  201502.0  100.0        3.0
2  A03  201503.0  100.0        3.0
3  A04  201504.0  100.0        3.0
4  A05  201505.0  100.0        3.0
5  NaN       NaN    NaN        NaN

In [124]:
sortedDataBasic = sortedData[ (sortedData.col3 > 80) ]
sortedDataBasic

  col1    col2  col3
0  A01  201501   100
1  A02  201502   100
2  A03  201503   100
3  A04  201504   100
4  A05  201505   100

In [126]:
sortedDataQuery = sortedData.query("col3 > 80")
sortedDataQuery

  col1    col2  col3
0  A01  201501   100
1  A02  201502   100
2  A03  201503   100
3  A04  201504   100
4  A05  201505   100

In [127]:
from itertools import repeat
a = ["A01","A02","A03","A04","A05"]
b = list(range(201501,201506,1))
c = list(repeat(100,5))
my_dict = {"b":a, "c":b, "a":c}
my_dict

{'a': [100, 100, 100, 100, 100],
 'b': ['A01', 'A02', 'A03', 'A04', 'A05'],
 'c': [201501, 201502, 201503, 201504, 201505]}

In [128]:
import pandas as pd
testdf = pd.DataFrame(my_dict)
testdf

     a    b       c
0  100  A01  201501
1  100  A02  201502
2  100  A03  201503
3  100  A04  201504
4  100  A05  201505

In [129]:
from itertools import repeat
a = ["A01","A02","A03","A04","A05"]
b = list(range(201501,201506,1))
c = list(repeat(100,5))

testList = [[],[],[]]
for i in range(0,3):
    if i==0:
        testList[i] = a
    elif i==1:
        testList[i] = b
    else:
        testList[i] = c
testList
my_dict2 = pd.DataFrame(testList)
my_dict2

        0       1       2       3       4
0     A01     A02     A03     A04     A05
1  201501  201502  201503  201504  201505
2     100     100     100     100     100

In [131]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM customerdata', engine) 

# 컬럼해더 재정의
customerData.columns = ['CUSTID','AVGPRICE','EMI','DEVICECOUNT','PRODUCTAGE','CUSTTYPE']

# 데이터 VIEW
customerData.head()

   CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  E11917  3516.500000    2          5.5    2.087540  Big-Screen-lover
1  E16075  3418.048887    2          4.2    2.771469      Sleeping-dog
2  E16221  3408.300000    2          5.0    1.988682  Big-Screen-lover
3  E18145  3408.300000    2          4.9    1.521029  Big-Screen-lover
4  E19404  3764.940414    2          6.5    0.900000        Early-bird

# A. 데이터 조작하기

### 1. 원하는 행 조회하기

In [133]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM customerdata', engine) 

# 컬럼해더 재정의
customerData.columns = ['CUSTID','AVGPRICE','EMI','DEVICECOUNT','PRODUCTAGE','CUSTTYPE']

# 데이터 VIEW
customerData.head()

## 조건 설정
customerData[ (customerData.EMI==3) & (customerData.DEVICECOUNT>5) ]
cleansingData = customerData.query('EMI == 3 & DEVICECOUNT > 5')
cleansingData.head()

    CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE    CUSTTYPE
8   F17131  3179.708359    3          6.5         1.1  Early-bird
14  G16437  3787.328898    3          6.7         1.0  Early-bird
17  G18402  3402.199381    3          6.5         1.0  Early-bird
21  H16326  3988.935304    3          6.5         0.9  Early-bird
26  I12899  3018.895637    3          6.4         0.9  Early-bird

### 인덱스로 행 선택하기

In [134]:
df1 = customerData.iloc[0:3]
print(df1)
df2 = customerData.loc[0:3]
print(df2)
df3 = customerData.ix[0:3]
print(df3)

   CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  E11917  3516.500000    2          5.5    2.087540  Big-Screen-lover
1  E16075  3418.048887    2          4.2    2.771469      Sleeping-dog
2  E16221  3408.300000    2          5.0    1.988682  Big-Screen-lover
   CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  E11917  3516.500000    2          5.5    2.087540  Big-Screen-lover
1  E16075  3418.048887    2          4.2    2.771469      Sleeping-dog
2  E16221  3408.300000    2          5.0    1.988682  Big-Screen-lover
3  E18145  3408.300000    2          4.9    1.521029  Big-Screen-lover
   CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  E11917  3516.500000    2          5.5    2.087540  Big-Screen-lover
1  E16075  3418.048887    2          4.2    2.771469      Sleeping-dog
2  E16221  3408.300000    2          5.0    1.988682  Big-Screen-lover
3  E18145  3408.300000    2          4.9    1.521029  Big-Screen-lover

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """

### 인덱스 초기화하기

In [136]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM kopo_customerdata', engine) 


# 데이터 VIEW
customerData.head()
ct2 = customerData[ (customerData.gender=="Male") & (customerData.email > 0) ]
ct2.head(10)
print(len(ct2))

9836

In [137]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM customerdata', engine) 


# 데이터 VIEW
customerData.head()

   custid     avgprice  emi  devicecount  productage          custtype
0  E11917  3516.500000    2          5.5    2.087540  Big-Screen-lover
1  E16075  3418.048887    2          4.2    2.771469      Sleeping-dog
2  E16221  3408.300000    2          5.0    1.988682  Big-Screen-lover
3  E18145  3408.300000    2          4.9    1.521029  Big-Screen-lover
4  E19404  3764.940414    2          6.5    0.900000        Early-bird

### 퀴즈

In [138]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 


# 데이터 VIEW
customerData.head()

  regionid productgroup yearweek    volume
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

In [141]:
customerData.columns = [x.upper() for x in customerData.columns]

In [142]:
customerData.head()

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

In [143]:
finalData = customerData[ (customerData["PRODUCTGROUP"] == "ST0002") & (customerData["VOLUME"] > 300000)]

In [144]:
finalData2 = finalData.reset_index(drop=True)

In [145]:
finalData2.iloc[0:2, :]

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0      A01       ST0002   201552  422468.0
1      A01       ST0002   201551  356271.0

In [146]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM kopo_customerdata', engine) 


# 데이터 VIEW
customerData.head()

,customercode,statename,st,gender,dob,gender1,email,fest_cnt,total_amount,ac_amount,av_amount,ha_amount,emi_ce_amount,is_highend,cnt_vist,gap_visit
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

In [147]:
cust2 = customerData.query("gender == 'Male' & email > 0")
len(cust2)

9836

In [148]:
ct2[ (ct2.customercode == "1585965") ]

,customercode,statename,st,gender,dob,gender1,email,fest_cnt,total_amount,ac_amount,av_amount,ha_amount,emi_ce_amount,is_highend,cnt_vist,gap_visit
749,1585965,State2,2,Male,1,1,1,2,405200,40500,294000,70700,60000,0,3,152

### 2. 원하는 컬럼 조회하기

### 원하는컬럼 인덱스로 조회하기

In [150]:
# 인덱스
dfc1 = customerData.iloc[0:1,:]
dfc1

,customercode,statename,st,gender,dob,gender1,email,fest_cnt,total_amount,ac_amount,av_amount,ha_amount,emi_ce_amount,is_highend,cnt_vist,gap_visit
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0

In [152]:
dfc2 = customerData.loc[0:2,["customercode","statename"]]
dfc2

  customercode statename
0      1503989    State2
1      1190338    State2
2      1424715    State2

In [153]:
# like [포함문자]
customerDataC = customerData.filter(like='P', axis=1)
print(customerDataC.head())
# filter 함수 & regular express 활용하기
customerData3 = customerData.filter(regex='D$', axis=1)
customerData3.head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

### 3. Index 활용하여 조회하기

In [154]:
# like [포함문자]
customerDataC = customerData.iloc[0:1,0:2]
print(customerDataC.head())

# filter 함수 & regular express 활용하기
customerDataC = customerData.iloc[0:1,:]
print(customerDataC.head())

  customercode statename
0      1503989    State2
  customercode statename  st gender  dob  gender1  email  fest_cnt  \
0      1503989    State2   2   Male    0        1      1         0

   total_amount  ac_amount  av_amount  ha_amount  emi_ce_amount  is_highend  \
0         30300          0      30300          0              0           0

   cnt_vist  gap_visit
0         1          0

### 4. 이상 데이터 정제하기

In [157]:
import pandas as pd
from sqlalchemy import create_engine 
import numpy as np
    
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM customerdata', engine) 

customerData.columns = ["CUSTID","AVGPRICE","EMI","DEVICECOUNT","PRODUCTAGE","CUSTTYPE"]

# 데이터 VIEW
customerData.head()

   CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  E11917  3516.500000    2          5.5    2.087540  Big-Screen-lover
1  E16075  3418.048887    2          4.2    2.771469      Sleeping-dog
2  E16221  3408.300000    2          5.0    1.988682  Big-Screen-lover
3  E18145  3408.300000    2          4.9    1.521029  Big-Screen-lover
4  E19404  3764.940414    2          6.5    0.900000        Early-bird

In [158]:

customerData["PRODUCTAGE_NEW"] = np.where(customerData["PRODUCTAGE"] < 1, 1,\
                                          np.where(customerData["PRODUCTAGE"]<2, 2,\
                                          np.where(customerData["PRODUCTAGE"]<3, 3,\
                                          5)))
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,3
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,3
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,2
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,2
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1

In [159]:
def refining(df):
    if df['PRODUCTAGE'] < 1:
        return 1
    elif df['PRODUCTAGE'] < 2:
        return 2
    elif df['PRODUCTAGE'] < 3:
        return 3
    else:
        return 5

In [160]:
customerData["PRODUCTAGE_NEW2"]=customerData.apply(refining, axis=1)

In [161]:
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,3,3
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,3,3
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,2,2
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,2,2
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1,1

In [163]:
# numpy 라이브러리 
import numpy as np

#컬럼 추가 생성 및 조건에 따른 컬럼명 변경
customerData["PRODUCTAGE_NEW2"] = np.\
where(customerData["PRODUCTAGE"] < 3, 1, customerData["PRODUCTAGE"])
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,3,1.0
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,3,1.0
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,2,1.0
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,2,1.0
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1,1.0

### 5. 데이터 정렬하기

In [164]:
customerData.sort_values(["CUSTID","AVGPRICE"], ascending=[True,False])
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,3,1.0
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,3,1.0
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,2,1.0
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,2,1.0
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1,1.0

### 6. 데이터 요약분석 하기

In [165]:
# 평균 구하기
meanValue = customerData.\
groupby(['CUSTTYPE','EMI'], as_index=True)

In [166]:
# 평균 구하기
meanValue = customerData.\
groupby(['CUSTTYPE','EMI'], as_index=True).\
mean()
meanValue.head()

                         AVGPRICE  DEVICECOUNT  PRODUCTAGE  PRODUCTAGE_NEW  \
CUSTTYPE         EMI
Big-Screen-lover 1    3246.000000     5.000000    1.891624        2.000000
                 2    3535.317391     5.508696    2.223247        2.804348
                 3    4111.600000     6.400000    1.838520        2.333333
Early-bird       1    2390.083736     6.300000    1.000000        2.000000
                 2    3232.445885     6.460606    0.936364        1.242424

                      PRODUCTAGE_NEW2
CUSTTYPE         EMI
Big-Screen-lover 1           1.000000
                 2           1.102034
                 3           1.000000
Early-bird       1           1.000000
                 2           1.000000

In [167]:
# 기본통계치 구하기
stdValue = customerData.\
groupby(['CUSTTYPE','EMI'], as_index=True).\
describe()

print(stdValue)

                     AVGPRICE                                        \
                        count         mean         std          min
CUSTTYPE         EMI
Big-Screen-lover 1        1.0  3246.000000         NaN  3246.000000
                 2       46.0  3535.317391  322.633901  2650.900000
                 3        3.0  4111.600000  195.060324  3895.200000
Early-bird       1        1.0  2390.083736         NaN  2390.083736
                 2       33.0  3232.445885  345.810935  2411.008838
                 3       16.0  3455.966035  412.696326  2811.265932
Sleeping-dog     1        9.0  3185.918464  199.545685  2963.370122
                 2       41.0  3504.298670  317.495859  2857.684730

                                                                          \
                              25%          50%          75%          max
CUSTTYPE         EMI
Big-Screen-lover 1    3246.000000  3246.000000  3246.000000  3246.000000
                 2    3367.725000  3489.450000  3719.375000  4165.700000
                 3    4030.450000  4165.700000  4219.800000  4273.900000
Early-bird       1    2390.083736  2390.083736  2390.083736  2390.083736
                 2    2991.014703  3256.152962  3436.456382  4020.245162
                 3    3145.243316  3464.950624  3703.933945  4296.873743
Sleeping-dog     1    2980.229239  3159.839204  3374.091339  3419.462596
                 2    3266.600816  3481.314549  3706.655001  4166.533130

                     DEVICECOUNT              ...    PRODUCTAGE_NEW       \
                           count      mean    ...               75%  max
CUSTTYPE         EMI                          ...
Big-Screen-lover 1           1.0  5.000000    ...               2.0  2.0
                 2          46.0  5.508696    ...               3.0  5.0
                 3           3.0  6.400000    ...               2.5  3.0
Early-bird       1           1.0  6.300000    ...               2.0  2.0
                 2          33.0  6.460606    ...               1.0  2.0
                 3          16.0  6.475000    ...               2.0  2.0
Sleeping-dog     1           9.0  3.833333    ...               3.0  3.0
                 2          41.0  4.353659    ...               3.0  5.0

                     PRODUCTAGE_NEW2                                          \
                               count      mean       std  min  25%  50%  75%
CUSTTYPE         EMI
Big-Screen-lover 1               1.0  1.000000       NaN  1.0  1.0  1.0  1.0
                 2              46.0  1.102034  0.483890  1.0  1.0  1.0  1.0
                 3               3.0  1.000000  0.000000  1.0  1.0  1.0  1.0
Early-bird       1               1.0  1.000000       NaN  1.0  1.0  1.0  1.0
                 2              33.0  1.000000  0.000000  1.0  1.0  1.0  1.0
                 3              16.0  1.000000  0.000000  1.0  1.0  1.0  1.0
Sleeping-dog     1               9.0  1.000000  0.000000  1.0  1.0  1.0  1.0
                 2              41.0  1.548156  0.980237  1.0  1.0  1.0  1.0


                           max
CUSTTYPE         EMI
Big-Screen-lover 1    1.000000
                 2    3.367229
                 3    1.000000
Early-bird       1    1.000000
                 2    1.000000
                 3    1.000000
Sleeping-dog     1    1.000000
                 2    3.483573

[8 rows x 40 columns]

### 7. 데이터 컬럼명 변경하기

In [171]:
customerData.head(2)

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,3,1.0
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,3,1.0

In [172]:
# 변경전 컬럼
customerData.columns
print(customerData.columns)

#컬럼명 전체 변경
customerData.columns = \
["CUSTID","AVGPRICE","EMI", \
 "DEVICECOUNT", "PRODUCTAGE", "CUSTTYPE", "P_AGE_NEW", "P_AGE_NEW2"]

#컬럼명 부분 변경
customerData.rename(columns={"TEST": "RENAME_COLUMN"})
customerData.head()

Index(['CUSTID', 'AVGPRICE', 'EMI', 'DEVICECOUNT', 'PRODUCTAGE', 'CUSTTYPE',
       'PRODUCTAGE_NEW', 'PRODUCTAGE_NEW2'],
      dtype='object')

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,P_AGE_NEW,P_AGE_NEW2
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,3,1.0
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,3,1.0
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,2,1.0
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,2,1.0
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1,1.0

In [173]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM customerdata', engine) 

customerData.columns = ["CUSTID","AVGPRICE","EMI","DEVICECOUNT","PRODUCTAGE","CUSTTYPE"]

# 데이터 VIEW
customerData.head()

   CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  E11917  3516.500000    2          5.5    2.087540  Big-Screen-lover
1  E16075  3418.048887    2          4.2    2.771469      Sleeping-dog
2  E16221  3408.300000    2          5.0    1.988682  Big-Screen-lover
3  E18145  3408.300000    2          4.9    1.521029  Big-Screen-lover
4  E19404  3764.940414    2          6.5    0.900000        Early-bird

In [174]:
customerData['NEW_COLUMN'] = 1
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,1
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,1
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,1
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,1
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1

In [175]:
customerData['NEW_COLUMN'].loc[0:]=2
customerData.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,2
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,2
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,2
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,2
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,2

In [176]:
len(customerData)

150

In [177]:
customerData.to_csv("d:/test.csv")

In [179]:
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,2
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,2
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,2
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,2
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,2

In [180]:
customerData['NEW_COLUMN'].loc[0:]= customerData['DEVICECOUNT'].loc[:3].mean()
customerData.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,4.9
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,4.9
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,4.9
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,4.9
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,4.9

In [181]:
customerData["PRODUCTAGE"][1]

2.77146943110041

### 데이터 롤링(이동평균 구하기)

In [182]:
order = 5

In [183]:
suborder = 4

In [184]:
import math
suborder = math.floor(5/2)
suborder

2

In [186]:
customerData["TEST"] = customerData["PRODUCTAGE"].rolling(window = 5, center = False).mean()

In [187]:
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN,TEST
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,4.9,NaN
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,4.9,NaN
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,4.9,NaN
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,4.9,NaN
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,4.9,1.853744

In [188]:
list = []
for i in range(0,suborder):
    list.append(customerData["PRODUCTAGE"][0:i+suborder].mean())
list

[2.42950459765736, 2.2825638908675567]

In [189]:
import pandas as pd
from sqlalchemy import create_engine 

# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 

#컬럼 재정의(대문자로 바꾸는 방법)
customerData.columns = [x.upper() for x in customerData.columns]
customerData.head()

#TEST = 이동평균
customerData["TEST"] = customerData["VOLUME"].rolling(window=5, center=True).mean()
customerData.head()

#RATIO = VOLUME/이동평균
customerData["RATIO"] = customerData["VOLUME"]/customerData["TEST"]
customerData.head()

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME      TEST     RATIO
0      A01       ST0002   201512  151750.0       NaN       NaN
1      A01       ST0001   201520  645626.0       NaN       NaN
2      A01       ST0002   201520  125863.0  372476.4  0.337909
3      A01       ST0001   201515  810144.0  476419.2  1.700486
4      A01       ST0002   201515  128999.0  374187.4  0.344744

### 퀴즈 #2

-  데이터 불러오기

In [190]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 


# 데이터 VIEW
selloutData.tail(3)

    regionid productgroup yearweek    volume
156      A01       ST0001   201614  739977.0
157      A01       ST0002   201614  148835.0
158      A01       ST0001   201641  746061.0

- 컬럼명 대문자 변환

In [191]:
selloutData.columns=[x.upper() for x in selloutData.columns]
selloutData.head()

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

- 정렬하기 (REGIONID -> PRODUCTGROUP -> YEARWEEK)

In [192]:
sortedDataPre = selloutData.sort_values(["REGIONID","PRODUCTGROUP","YEARWEEK"])

In [193]:
sortedDataPre.head(2)

   REGIONID PRODUCTGROUP YEARWEEK    VOLUME
36      A01       ST0001   201501  513598.0
24      A01       ST0001   201502  438251.0

In [194]:
sortedData = sortedDataPre.reset_index(drop=True)
sortedData

    REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0        A01       ST0001   201501  513598.0
1        A01       ST0001   201502  438251.0
2        A01       ST0001   201503  420290.0
3        A01       ST0001   201504  458431.0
4        A01       ST0001   201505  482381.0
5        A01       ST0001   201506  570412.0
6        A01       ST0001   201507  620392.0
7        A01       ST0001   201508  571781.0
8        A01       ST0001   201509  569545.0
9        A01       ST0001   201510  511679.0
10       A01       ST0001   201511  524787.0
11       A01       ST0001   201512  486509.0
12       A01       ST0001   201513  470040.0
13       A01       ST0001   201514  428195.0
14       A01       ST0001   201515  810144.0
15       A01       ST0001   201516  764927.0
16       A01       ST0001   201517  697502.0
17       A01       ST0001   201518  671464.0
18       A01       ST0001   201519  682757.0
19       A01       ST0001   201520  645626.0
20       A01       ST0001   201521  620290.0
21       A01       ST0001   201522  603104.0
22       A01       ST0001   201523  610479.0
23       A01       ST0001   201524  589613.0
24       A01       ST0001   201525  618699.0
25       A01       ST0001   201526  586721.0
26       A01       ST0001   201527  599043.0
27       A01       ST0001   201528  587529.0
28       A01       ST0001   201529  620882.0
29       A01       ST0001   201530  643984.0
..       ...          ...      ...       ...
129      A01       ST0002   201550  294579.0
130      A01       ST0002   201551  356271.0
131      A01       ST0002   201552  422468.0
132      A01       ST0002   201553  232523.0
133      A01       ST0002   201601  162801.0
134      A01       ST0002   201602  137186.0
135      A01       ST0002   201603  152763.0
136      A01       ST0002   201604  197057.0
137      A01       ST0002   201605  231214.0
138      A01       ST0002   201606  172230.0
139      A01       ST0002   201607  161324.0
140      A01       ST0002   201608  130000.0
141      A01       ST0002   201609  154149.0
142      A01       ST0002   201610  142575.0
143      A01       ST0002   201611  150915.0
144      A01       ST0002   201612  132780.0
145      A01       ST0002   201613  135788.0
146      A01       ST0002   201614  148835.0
147      A01       ST0002   201615  143180.0
148      A01       ST0002   201616  137927.0
149      A01       ST0002   201617  142279.0
150      A01       ST0002   201618  162560.0
151      A01       ST0002   201619  152980.0
152      A01       ST0002   201620  160913.0
153      A01       ST0002   201621  205984.0
154      A01       ST0002   201622  214929.0
155      A01       ST0002   201623  161983.0
156      A01       ST0002   201624  171592.0
157      A01       ST0002   201625  157283.0
158      A01       ST0002   201626  196489.0

[159 rows x 4 columns]

- 이동평균 연산하기

In [195]:
sortedData.head(5)

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0      A01       ST0001   201501  513598.0
1      A01       ST0001   201502  438251.0
2      A01       ST0001   201503  420290.0
3      A01       ST0001   201504  458431.0
4      A01       ST0001   201505  482381.0

In [196]:
import math
# 이동평균 구간 크기
order = 5
# 앞뒤로 비어있게될 구간 크기
suborder = math.floor(order/2)

In [197]:
sortedData["MA"] = sortedData["VOLUME"].rolling(window = order, center = True).mean()
sortedData.head()

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME        MA
0      A01       ST0001   201501  513598.0       NaN
1      A01       ST0001   201502  438251.0       NaN
2      A01       ST0001   201503  420290.0  462590.2
3      A01       ST0001   201504  458431.0  473953.0
4      A01       ST0001   201505  482381.0  510381.2

- 이동평균 빈셀 채우기

In [199]:
sortedData.head(5)

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME        MA
0      A01       ST0001   201501  513598.0       NaN
1      A01       ST0001   201502  438251.0       NaN
2      A01       ST0001   201503  420290.0  462590.2
3      A01       ST0001   201504  458431.0  473953.0
4      A01       ST0001   201505  482381.0  510381.2

In [200]:
maxLength = len(sortedData)
maxLength

159

### 롤링 빈 값 채우기 유형

In [202]:
sortedData.loc[(maxLength-1)-(suborder+i):maxLength,"VOLUME"]

155    161983.0
156    171592.0
157    157283.0
158    196489.0
Name: VOLUME, dtype: float64

In [203]:
sortedData["VOLUME"][-(1+suborder+1):maxLength]

155    161983.0
156    171592.0
157    157283.0
158    196489.0
Name: VOLUME, dtype: float64

In [204]:
sortedData["VOLUME"][(maxLength-1)-(suborder+i):maxLength]

155    161983.0
156    171592.0
157    157283.0
158    196489.0
Name: VOLUME, dtype: float64

In [205]:
sortedData["VOLUME"][-(0+suborder+1):maxLength]

156    171592.0
157    157283.0
158    196489.0
Name: VOLUME, dtype: float64

In [206]:
sortedData["VOLUME"][-(i+suborder+1):maxLength].mean()

171836.75

In [207]:
postList = []
maxLength = len(sortedData)
for i in range(0,suborder):
    postList.append(sortedData["VOLUME"][-(i+suborder+1):maxLength].mean())
    sortedData["MA"][maxLength-i-1] = postList[i]
postList

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

[175121.33333333334, 171836.75]

In [208]:
sortedData.tail()

    REGIONID PRODUCTGROUP YEARWEEK    VOLUME             MA
154      A01       ST0002   201622  214929.0  183080.200000
155      A01       ST0002   201623  161983.0  182354.200000
156      A01       ST0002   201624  171592.0  180455.200000
157      A01       ST0002   201625  157283.0  171836.750000
158      A01       ST0002   201626  196489.0  175121.333333

In [209]:
sortedData["MA"][3]

473953.0

In [210]:
sortedData["MA"][maxLength-1-1]

171836.75

In [211]:
sortedData.tail()

    REGIONID PRODUCTGROUP YEARWEEK    VOLUME             MA
154      A01       ST0002   201622  214929.0  183080.200000
155      A01       ST0002   201623  161983.0  182354.200000
156      A01       ST0002   201624  171592.0  180455.200000
157      A01       ST0002   201625  157283.0  171836.750000
158      A01       ST0002   201626  196489.0  175121.333333

In [212]:
sortedData["VOLUME"][maxLength-2]

157283.0

In [213]:
postList

[175121.33333333334, 171836.75]

In [214]:
sortedData["VOLUME"][-(0+suborder+1):maxLength]

156    171592.0
157    157283.0
158    196489.0
Name: VOLUME, dtype: float64

In [215]:
sortedData.tail()

    REGIONID PRODUCTGROUP YEARWEEK    VOLUME             MA
154      A01       ST0002   201622  214929.0  183080.200000
155      A01       ST0002   201623  161983.0  182354.200000
156      A01       ST0002   201624  171592.0  180455.200000
157      A01       ST0002   201625  157283.0  171836.750000
158      A01       ST0002   201626  196489.0  175121.333333

In [216]:
sortedData["VOLUME"][0:suborder+0+1]

0    513598.0
1    438251.0
2    420290.0
Name: VOLUME, dtype: float64

In [217]:
preList = []
for i in range(0,suborder):
    preList.append(sortedData["VOLUME"][0:suborder+i+1].mean())
    sortedData.loc[i,"MA"] = preList[i]
preList

[457379.6666666667, 457642.5]

In [218]:
sortedData.head()

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME             MA
0      A01       ST0001   201501  513598.0  457379.666667
1      A01       ST0001   201502  438251.0  457642.500000
2      A01       ST0001   201503  420290.0  462590.200000
3      A01       ST0001   201504  458431.0  473953.000000
4      A01       ST0001   201505  482381.0  510381.200000

In [219]:
sortedData.head(2)

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME             MA
0      A01       ST0001   201501  513598.0  457379.666667
1      A01       ST0001   201502  438251.0  457642.500000

- 비율 계산하기

In [220]:
sortedData["RATIO"] = sortedData["VOLUME"]/sortedData["MA"]

In [222]:
sortedData.to_csv("d:/sortedData2.csv")

In [223]:
sortedData.head(2)

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME             MA     RATIO
0      A01       ST0001   201501  513598.0  457379.666667  1.122914
1      A01       ST0001   201502  438251.0  457642.500000  0.957627

In [224]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData2 = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine) 


# 데이터 VIEW
selloutData2.head()

  regionid productgroup yearweek    volume
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

In [225]:
selloutData2.columns = [ x.upper() for x in selloutData2.columns]
selloutData2.head(2)

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0

In [226]:
groupData = selloutData2.groupby(["REGIONID","PRODUCTGROUP"]).mean()
groupData

                              VOLUME
REGIONID PRODUCTGROUP
A01      ST0001        685861.837500
         ST0002        185002.443038

In [227]:
groupDataFinal = groupData.reset_index()

In [228]:
groupDataFinal[(groupDataFinal.PRODUCTGROUP =="ST0002")]

  REGIONID PRODUCTGROUP         VOLUME
1      A01       ST0002  185002.443038

In [229]:
groupDataFinal

  REGIONID PRODUCTGROUP         VOLUME
0      A01       ST0001  685861.837500
1      A01       ST0002  185002.443038

In [230]:
selloutData2.head()

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0      A01       ST0002   201512  151750.0
1      A01       ST0001   201520  645626.0
2      A01       ST0002   201520  125863.0
3      A01       ST0001   201515  810144.0
4      A01       ST0002   201515  128999.0

In [231]:
NewDF=pd.merge(selloutData2 , groupDataFinal, how='inner', on=["REGIONID","PRODUCTGROUP"])[["REGIONID","PRODUCTGROUP","YEARWEEK","VOLUME_x","VOLUME_y"]]

In [232]:
NewDF.head()

  REGIONID PRODUCTGROUP YEARWEEK  VOLUME_x       VOLUME_y
0      A01       ST0002   201512  151750.0  185002.443038
1      A01       ST0002   201520  125863.0  185002.443038
2      A01       ST0002   201515  128999.0  185002.443038
3      A01       ST0002   201518  134467.0  185002.443038
4      A01       ST0002   201513  140297.0  185002.443038

In [233]:
sortedDataPre = selloutData2.sort_values(["REGIONID","PRODUCTGROUP","YEARWEEK"])

In [234]:
sortedData = sortedDataPre.reset_index(drop=True)

In [235]:
groupRolling = sortedData.groupby(["REGIONID","PRODUCTGROUP"])[["VOLUME"]].rolling(window=5, center=True).mean()
test = groupRolling.reset_index()

In [238]:
def sub_function(data):
    data["MA"] = data["VOLUME"].rolling(window = 5, center = True).mean()
    return data

In [239]:
groupResult = sortedData.groupby(["REGIONID","PRODUCTGROUP"]).apply(sub_function)
groupResult.head(2)

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME  MA
0      A01       ST0001   201501  513598.0 NaN
1      A01       ST0001   201502  438251.0 NaN

In [113]:
groupResult.to_csv("d:/groupResult.csv")

In [240]:
renamedData = selloutData.rename(columns = {"REGIONID": "KOPO_REGIONID"})
renamedData.head(2)

  KOPO_REGIONID PRODUCTGROUP YEARWEEK    VOLUME
0           A01       ST0002   201512  151750.0
1           A01       ST0001   201520  645626.0

In [241]:
sortedData2 = selloutData.sort_values(["REGIONID","PRODUCTGROUP","YEARWEEK"])

In [243]:
sortedData2.to_csv("d:/test3.csv")

In [244]:
sortedData3 = sortedData2.groupby(["REGIONID","PRODUCTGROUP"]).apply(sub_function)

### customerData ROLLING

In [251]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
customerData = pd.read_sql_query('SELECT * FROM customerdata', engine) 


# 데이터 VIEW
customerData.head()

   custid     avgprice  emi  devicecount  productage          custtype
0  E11917  3516.500000    2          5.5    2.087540  Big-Screen-lover
1  E16075  3418.048887    2          4.2    2.771469      Sleeping-dog
2  E16221  3408.300000    2          5.0    1.988682  Big-Screen-lover
3  E18145  3408.300000    2          4.9    1.521029  Big-Screen-lover
4  E19404  3764.940414    2          6.5    0.900000        Early-bird

In [252]:
customerData.columns = [x.upper() for x in customerData.columns]

In [253]:
customerData['NEW_COLUMN'] = customerData['AVGPRICE'].rolling(window=5, center=True).mean()
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,NaN
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,NaN
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,3503.217860
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,3438.131025
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,3587.661247

In [254]:
customerData['NEW_COLUMN'].loc[0:]=1
customerData.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,1.0
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,1.0
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,1.0
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,1.0
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1.0

In [255]:
customerData['NEW_COLUMN'].loc[0:]=customerData['NEW_COLUMN'].loc[0:5].mean()
customerData.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,1.0
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,1.0
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,1.0
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,1.0
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1.0

In [256]:
grades = []
for row in customerData['PRODUCTAGE']:
    if row >= 2:
        grades.append("A")
    else:
        grades.append("D")
customerData['grade'] = grades
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN,grade
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,1.0,A
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,1.0,A
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,1.0,D
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,1.0,D
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1.0,D

In [257]:
def pass_or_fail(row):
    if row != 'D':
        return "Fail"
    else:
        return "Pass"

In [258]:
customerData["new grade"] = customerData.grade.apply(pass_or_fail)
customerData.head()

,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,NEW_COLUMN,grade,new grade
0,E11917,3516.500000,2,5.5,2.087540,Big-Screen-lover,1.0,A,Fail
1,E16075,3418.048887,2,4.2,2.771469,Sleeping-dog,1.0,A,Fail
2,E16221,3408.300000,2,5.0,1.988682,Big-Screen-lover,1.0,D,Pass
3,E18145,3408.300000,2,4.9,1.521029,Big-Screen-lover,1.0,D,Pass
4,E19404,3764.940414,2,6.5,0.900000,Early-bird,1.0,D,Pass

# B. 데이터 합치기

In [267]:
import pandas as pd
from sqlalchemy import create_engine 
 
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl') 
#engine = create_engine('oracle+cx_oracle://kopo:kopo@127.0.0.1:1521/xe') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selectExample = pd.read_sql_query('SELECT * FROM kopo_channel_seasonality_new', engine) 

print(selectExample.head())

# DB 테이블을 읽어 Data Frame 변수에 저장하기
regionMasterData = pd.read_sql_query('SELECT * FROM kopo_region_mst', engine) 

print(regionMasterData.head())

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0
  regionid regionname
0      A00       아프리카
1      A01         미국
2      A02         한국
3      A03         독일
4      A04        브라질

In [268]:
selectExample.head()

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

In [269]:
groupData = selectExample.groupby(["regionid","product"], as_index=False)[["qty"]].mean()
groupData.head()

  regionid    product            qty
0      A00  PRODUCT34     132.445860
1      A00  PRODUCT58     105.235669
2      A00  PRODUCT59   36086.547771
3      A01   PRODUCT1    5716.726115
4      A01  PRODUCT12  197052.777070

In [270]:
groupData = selectExample.groupby(["regionid","product"], as_index=False)["qty"].mean()
groupData.head()

  regionid    product            qty
0      A00  PRODUCT34     132.445860
1      A00  PRODUCT58     105.235669
2      A00  PRODUCT59   36086.547771
3      A01   PRODUCT1    5716.726115
4      A01  PRODUCT12  197052.777070

In [271]:
groupData = selectExample.groupby(["regionid","product"]).mean().reset_index()
groupData.head()

  regionid    product            qty
0      A00  PRODUCT34     132.445860
1      A00  PRODUCT58     105.235669
2      A00  PRODUCT59   36086.547771
3      A01   PRODUCT1    5716.726115
4      A01  PRODUCT12  197052.777070

In [272]:
selectExample.head()

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

In [273]:
mergeData = pd.merge(selectExample, groupData,\
         on=["regionid","product"],suffixes=('_a', '_b'), how="left")
mergeData.head(2)

  regionid    product yearweek    qty_a         qty_b
0      A60   PRODUCT4   201402     71.0     44.662420
1      A60  PRODUCT59   201402  22275.0  35366.050955

In [274]:
mergeData["ratio"] = mergeData["qty_a"]/mergeData["qty_b"]
mergeData.head(10)

  regionid    product yearweek    qty_a         qty_b     ratio
0      A60   PRODUCT4   201402     71.0     44.662420  1.589703
1      A60  PRODUCT59   201402  22275.0  35366.050955  0.629841
2      A60  PRODUCT34   201402   4463.0   6117.560510  0.729539
3      A60  PRODUCT47   201402      0.0      0.363057  0.000000
4      A60  PRODUCT56   201402     23.0     18.560510  1.239190
5      A60  PRODUCT57   201402     14.0    147.248408  0.095077
6      A60  PRODUCT12   201402   1186.0   1216.171975  0.975191
7      A60   PRODUCT1   201402      7.0      3.522293  1.987342
8      A60  PRODUCT33   201402    101.0     60.719745  1.663380
9      A60  PRODUCT62   201402    336.0    328.993631  1.021296

# C. 피벗 활용하기

In [279]:
#  피벗 예시
pivotResult = selectExample.\
pivot_table(index = ['regionid','product'], columns='yearweek', values='qty')
pivotResultFinal = pivotResult
pivotResultFinal.head(5)

yearweek              201401    201402    201403    201404    201405  \
regionid product
A00      PRODUCT34     661.0     679.0     578.0     532.0     516.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    9988.0    9005.0    8416.0    8553.0   10355.0
A01      PRODUCT1    14115.0    9169.0   21350.0    9457.0   10254.0
         PRODUCT12  139564.0  109173.0  119281.0  139609.0  167828.0

yearweek              201406    201407    201408    201409    201410  \
regionid product
A00      PRODUCT34     423.0     407.0     364.0     470.0     538.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59   13799.0   17292.0   16369.0   15047.0   15895.0
A01      PRODUCT1    10327.0    9581.0   10156.0    9045.0    8141.0
         PRODUCT12  124848.0  157644.0  162431.0  147877.0  145733.0

yearweek              ...       201643    201644    201645    201646  \
regionid product      ...
A00      PRODUCT34    ...         11.0      15.0      18.0      14.0
         PRODUCT58    ...        155.0     213.0     126.0     101.0
         PRODUCT59    ...      15337.0   19388.0   21567.0   18314.0
A01      PRODUCT1     ...        549.0     452.0     531.0     654.0
         PRODUCT12    ...     158291.0  178978.0  192137.0  441993.0

yearweek               201647    201648    201649    201650    201651  \
regionid product
A00      PRODUCT34        9.0      17.0      19.0      35.0      73.0
         PRODUCT58      141.0     175.0     155.0     104.0      27.0
         PRODUCT59    19733.0   18127.0   22993.0   26854.0   30237.0
A01      PRODUCT1       962.0     789.0     385.0     287.0     292.0
         PRODUCT12  1663206.0  711806.0  278487.0  320253.0  401602.0

yearweek              201652
regionid product
A00      PRODUCT34      22.0
         PRODUCT58      19.0
         PRODUCT59   33511.0
A01      PRODUCT1      599.0
         PRODUCT12  208186.0

[5 rows x 157 columns]

In [280]:
#  피벗 예시
pivotResult = selectExample.\
pivot_table(index = ['regionid','product'], columns='yearweek', values='qty')
pivotResult.reset_index()
print(pivotResult)
pivotResult.columns

pivotResult.head()

unpivotResult=pivotResult.stack().reset_index()
unpivotResult.columns=\
['regionid','product','yearweek','qty']
print(unpivotResult)
unpivotResult.head()

yearweek              201401    201402    201403    201404    201405  \
regionid product
A00      PRODUCT34     661.0     679.0     578.0     532.0     516.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    9988.0    9005.0    8416.0    8553.0   10355.0
A01      PRODUCT1    14115.0    9169.0   21350.0    9457.0   10254.0
         PRODUCT12  139564.0  109173.0  119281.0  139609.0  167828.0
         PRODUCT14    9844.0    6363.0    8022.0    7562.0    6035.0
         PRODUCT15    5684.0    4049.0    3689.0    4341.0    3379.0
         PRODUCT16    1316.0     919.0    1018.0     905.0    1114.0
         PRODUCT19    1519.0    2401.0    1513.0    2264.0    2199.0
         PRODUCT2      225.0     203.0     236.0     203.0     246.0
         PRODUCT20      41.0       6.0      59.0      21.0      22.0
         PRODUCT33    7043.0    5337.0    6940.0    6041.0    4385.0
         PRODUCT34   14836.0   12032.0   13514.0   13798.0   12496.0
         PRODUCT4    18722.0   14310.0   17331.0   21018.0   24596.0
         PRODUCT47    5650.0    4286.0    4436.0    4167.0    3276.0
         PRODUCT56    5000.0    4611.0    5449.0    5436.0    5277.0
         PRODUCT57    9660.0    9108.0   13394.0    9196.0    8550.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59  253391.0  232995.0  237089.0  240723.0  310006.0
         PRODUCT6        0.0       1.0       0.0       0.0       0.0
         PRODUCT60      13.0      10.0       4.0      10.0      13.0
         PRODUCT62    5987.0    3309.0    3823.0    3325.0    3855.0
         PRODUCT63   47708.0   38334.0   31379.0   37305.0   43301.0
         PRODUCT7     1153.0     868.0     789.0     792.0     972.0
         PRODUCT75   15798.0   21562.0   23768.0   23462.0   28700.0
         PRODUCT8      164.0     102.0     105.0     258.0     160.0
A02      PRODUCT1      321.0     188.0     168.0      75.0     154.0
         PRODUCT12    9487.0    4874.0    5496.0    4512.0    5507.0
         PRODUCT14    2272.0    1149.0     923.0     938.0    1079.0
         PRODUCT16       0.0       0.0      -1.0       0.0       0.0
...                      ...       ...       ...       ...       ...
A65      PRODUCT1      163.0     131.0     105.0     113.0      99.0
         PRODUCT12     907.0     898.0     953.0     969.0    1258.0
         PRODUCT14       0.0       0.0       0.0       0.0       0.0
         PRODUCT33     121.0     120.0     115.0      86.0      93.0
         PRODUCT34     204.0     166.0     204.0     241.0     198.0
         PRODUCT40      34.0      27.0      42.0      29.0      30.0
         PRODUCT47      11.0      19.0      12.0      16.0      20.0
         PRODUCT56      59.0      87.0     101.0      72.0      46.0
         PRODUCT57      58.0      94.0      97.0     124.0     301.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    3077.0    3109.0    3003.0    3484.0    3463.0
         PRODUCT60      58.0      96.0      81.0      62.0      75.0
         PRODUCT62     183.0     164.0     146.0     197.0     136.0
A66      PRODUCT34      65.0      76.0      56.0      53.0      38.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59     583.0     609.0     394.0     302.0     303.0
A67      PRODUCT34     457.0     628.0     669.0     650.0     654.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    5372.0    7076.0    6931.0    7676.0    7633.0
A68      PRODUCT34     207.0     246.0     191.0     250.0     323.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    1061.0    1835.0    1356.0    1416.0    1460.0
A69      PRODUCT34     299.0     252.0     210.0     151.0     125.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59     697.0     559.0     423.0     386.0     311.0
A70      PRODUCT34      66.0      84.0      67.0      60.0      46.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59     341.0     334.0     298.0     309.0     351.0
A77      PRODUCT1     3580.0    2465.0    2205.0    1623.0    1482.0
         PRODUCT12    3821.0    2466.0    2401.0    2628.0    1442.0

yearweek              201406    201407    201408    201409    201410  \
regionid product
A00      PRODUCT34     423.0     407.0     364.0     470.0     538.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59   13799.0   17292.0   16369.0   15047.0   15895.0
A01      PRODUCT1    10327.0    9581.0   10156.0    9045.0    8141.0
         PRODUCT12  124848.0  157644.0  162431.0  147877.0  145733.0
         PRODUCT14    8858.0    9796.0   10811.0    9000.0    9286.0
         PRODUCT15    4208.0    6211.0    3608.0    3824.0    3694.0
         PRODUCT16     991.0    1294.0    1327.0     988.0     965.0
         PRODUCT19    1428.0    2269.0    1414.0    2544.0    2064.0
         PRODUCT2      277.0     240.0     260.0     314.0     330.0
         PRODUCT20      18.0      37.0      23.0      33.0       7.0
         PRODUCT33    4854.0    6519.0    8519.0    8135.0    7632.0
         PRODUCT34   18152.0   35577.0   40100.0   38850.0   31439.0
         PRODUCT4    17662.0   23494.0   21528.0   19137.0   16086.0
         PRODUCT47    3684.0    4931.0    5966.0    4175.0    4187.0
         PRODUCT56    5777.0    5964.0    7592.0    7003.0    6849.0
         PRODUCT57    8392.0    8763.0    9314.0    8571.0    7857.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59  331793.0  420826.0  406640.0  379845.0  384239.0
         PRODUCT6        6.0       0.0       0.0       0.0       1.0
         PRODUCT60       5.0       2.0       2.0      -2.0       3.0
         PRODUCT62    7374.0    6679.0    6383.0    4571.0    5503.0
         PRODUCT63   35860.0   48170.0   47394.0   42695.0   40494.0
         PRODUCT7      878.0    1024.0    1401.0     978.0    1245.0
         PRODUCT75   24135.0   27527.0   31742.0   25819.0   30186.0
         PRODUCT8      156.0     110.0     126.0     115.0      81.0
A02      PRODUCT1      112.0     142.0     150.0     244.0     151.0
         PRODUCT12    4881.0    5391.0    4570.0    5437.0    4243.0
         PRODUCT14     782.0     978.0    1052.0    1256.0    1276.0
         PRODUCT16       0.0       0.0       0.0       0.0       0.0
...                      ...       ...       ...       ...       ...
A65      PRODUCT1      120.0     125.0     108.0     125.0      92.0
         PRODUCT12    2299.0    1562.0    1300.0    1527.0    1669.0
         PRODUCT14       0.0       0.0       0.0       0.0       0.0
         PRODUCT33     101.0      83.0      88.0     160.0     170.0
         PRODUCT34     243.0     210.0     261.0     364.0     300.0
         PRODUCT40      25.0      19.0      25.0      55.0      40.0
         PRODUCT47      23.0      19.0      15.0      16.0      19.0
         PRODUCT56      59.0      44.0      59.0      88.0      69.0
         PRODUCT57      85.0      66.0     104.0      84.0      67.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    3404.0    4034.0    3750.0    4445.0    4692.0
         PRODUCT60      66.0      55.0      74.0      69.0      72.0
         PRODUCT62     135.0     114.0     158.0     140.0     139.0
A66      PRODUCT34      46.0      67.0     108.0     152.0     146.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59     291.0     390.0     488.0     740.0     570.0
A67      PRODUCT34     676.0     684.0     554.0     543.0     482.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    7417.0    9727.0   11053.0   11145.0   13226.0
A68      PRODUCT34     335.0     349.0     297.0     375.0     391.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    1608.0    1994.0    2808.0    1918.0    2065.0
A69      PRODUCT34     105.0      85.0      71.0     132.0      93.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59     415.0     583.0     760.0     864.0     872.0
A70      PRODUCT34      53.0      44.0      33.0      28.0      33.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59     367.0     315.0     276.0     165.0     139.0
A77      PRODUCT1     4735.0    3633.0    4466.0    3293.0    2942.0
         PRODUCT12    3794.0    2409.0    2619.0    2587.0    2038.0

yearweek              ...       201643    201644    201645    201646  \
regionid product      ...
A00      PRODUCT34    ...         11.0      15.0      18.0      14.0
         PRODUCT58    ...        155.0     213.0     126.0     101.0
         PRODUCT59    ...      15337.0   19388.0   21567.0   18314.0
A01      PRODUCT1     ...        549.0     452.0     531.0     654.0
         PRODUCT12    ...     158291.0  178978.0  192137.0  441993.0
         PRODUCT14    ...      11311.0   18872.0   18153.0   21565.0
         PRODUCT15    ...       6543.0    2718.0    4465.0    4047.0
         PRODUCT16    ...       1254.0    1576.0    1459.0    2263.0
         PRODUCT19    ...       4690.0    3726.0    4254.0    4156.0
         PRODUCT2     ...      39328.0   32935.0   28774.0   29125.0
         PRODUCT20    ...         23.0     145.0      17.0      43.0
         PRODUCT33    ...      10964.0   14895.0   20127.0   20619.0
         PRODUCT34    ...      84873.0   90789.0   90373.0  120137.0
         PRODUCT4     ...      16690.0   18606.0   20375.0   79539.0
         PRODUCT47    ...       7194.0   18438.0   25102.0   28749.0
         PRODUCT56    ...       6281.0    7443.0    7728.0    8530.0
         PRODUCT57    ...       5035.0    5243.0    5395.0    5426.0
         PRODUCT58    ...      41252.0   28952.0   27780.0   32775.0
         PRODUCT59    ...     551038.0  601142.0  585098.0  630040.0
         PRODUCT6     ...        865.0    1399.0    2209.0    1309.0
         PRODUCT60    ...          2.0       1.0       2.0       5.0
         PRODUCT62    ...       2418.0    9788.0    8195.0   10691.0
         PRODUCT63    ...      24203.0   27891.0   26856.0   58242.0
         PRODUCT7     ...       4023.0    2908.0    3116.0    4283.0
         PRODUCT75    ...      31536.0   32115.0   24243.0   33144.0
         PRODUCT8     ...        105.0     137.0     633.0     170.0
A02      PRODUCT1     ...         35.0      47.0      36.0      61.0
         PRODUCT12    ...       8466.0    8216.0    8261.0   15513.0
         PRODUCT14    ...       1775.0    2471.0    1707.0    3704.0
         PRODUCT16    ...         41.0      43.0      53.0     143.0
...                   ...          ...       ...       ...       ...
A65      PRODUCT1     ...          9.0       7.0       3.0       6.0
         PRODUCT12    ...        760.0     592.0     790.0     744.0
         PRODUCT14    ...         27.0      19.0       9.0      17.0
         PRODUCT33    ...        168.0      69.0      94.0     130.0
         PRODUCT34    ...       1283.0    2763.0    1778.0    1207.0
         PRODUCT40    ...         16.0       8.0      10.0      10.0
         PRODUCT47    ...         30.0      16.0      39.0      40.0
         PRODUCT56    ...         95.0      67.0      72.0      51.0
         PRODUCT57    ...         97.0      86.0     103.0      93.0
         PRODUCT58    ...        264.0     404.0     393.0     405.0
         PRODUCT59    ...      13204.0   13140.0   13422.0   13218.0
         PRODUCT60    ...        117.0      78.0      68.0      73.0
         PRODUCT62    ...        211.0     150.0     146.0     170.0
A66      PRODUCT34    ...        153.0     178.0     169.0     120.0
         PRODUCT58    ...          1.0       2.0       5.0       9.0
         PRODUCT59    ...       2925.0    4606.0    3790.0    3250.0
A67      PRODUCT34    ...        763.0     792.0     765.0     753.0
         PRODUCT58    ...         10.0      16.0      48.0      50.0
         PRODUCT59    ...      23985.0   18370.0   20529.0   16633.0
A68      PRODUCT34    ...         46.0      45.0      61.0      36.0
         PRODUCT58    ...          2.0       1.0       0.0       0.0
         PRODUCT59    ...       2685.0    2644.0    2570.0    2251.0
A69      PRODUCT34    ...        229.0     206.0     550.0     189.0
         PRODUCT58    ...          1.0       3.0       0.0       1.0
         PRODUCT59    ...      17267.0   15683.0   16916.0   16697.0
A70      PRODUCT34    ...       1903.0    1886.0    2160.0    2490.0
         PRODUCT58    ...         80.0      77.0      58.0      31.0
         PRODUCT59    ...     102679.0   96626.0   88457.0   75856.0
A77      PRODUCT1     ...       3790.0    2450.0    2925.0    2998.0
         PRODUCT12    ...       5760.0    4109.0    4506.0    4255.0

yearweek               201647    201648    201649    201650     201651  \
regionid product
A00      PRODUCT34        9.0      17.0      19.0      35.0       73.0
         PRODUCT58      141.0     175.0     155.0     104.0       27.0
         PRODUCT59    19733.0   18127.0   22993.0   26854.0    30237.0
A01      PRODUCT1       962.0     789.0     385.0     287.0      292.0
         PRODUCT12  1663206.0  711806.0  278487.0  320253.0   401602.0
         PRODUCT14    49213.0   43209.0   28492.0   26844.0    26835.0
         PRODUCT15     3923.0    2786.0    2903.0    3070.0     3856.0
         PRODUCT16     5254.0    3324.0    2122.0    2509.0     3339.0
         PRODUCT19     4182.0    4003.0    5321.0    4647.0     3837.0
         PRODUCT2     99226.0   64182.0   51715.0   81901.0    60235.0
         PRODUCT20       98.0      87.0      92.0      63.0      128.0
         PRODUCT33    39368.0   35929.0   21721.0   18108.0    19051.0
         PRODUCT34   269099.0  192086.0  151447.0  176907.0   777140.0
         PRODUCT4    259197.0   85293.0   35088.0   45625.0    77838.0
         PRODUCT47    49130.0   36221.0   11500.0   11642.0    10730.0
         PRODUCT56    13514.0   11303.0    8732.0    8555.0     8375.0
         PRODUCT57     5898.0    5311.0    5250.0    5315.0     5690.0
         PRODUCT58    69441.0   66656.0  101974.0  120670.0   112189.0
         PRODUCT59  1037853.0  873341.0  749699.0  786380.0  1175605.0
         PRODUCT6     21897.0    2314.0    1441.0    1821.0    26930.0
         PRODUCT60        0.0      -1.0       2.0       1.0        2.0
         PRODUCT62    24343.0   20930.0   16540.0   19201.0    18346.0
         PRODUCT63   216635.0  101071.0   49184.0   73928.0   115612.0
         PRODUCT7      1675.0    5553.0    4500.0    4343.0     2759.0
         PRODUCT75   104559.0   51184.0   27384.0   33227.0    35489.0
         PRODUCT8        71.0     291.0      97.0     268.0      121.0
A02      PRODUCT1        66.0      64.0      61.0      38.0       61.0
         PRODUCT12    48994.0   15816.0    9022.0   11320.0    38235.0
         PRODUCT14     5626.0    2468.0    2014.0    3103.0     4949.0
         PRODUCT16      389.0      94.0      76.0     152.0      496.0
...                       ...       ...       ...       ...        ...
A65      PRODUCT1         5.0       6.0       5.0       8.0        9.0
         PRODUCT12     1294.0     909.0     950.0    1634.0     1565.0
         PRODUCT14       27.0      20.0      21.0      15.0        8.0
         PRODUCT33      192.0     133.0     146.0     155.0       89.0
         PRODUCT34     1614.0    1739.0    2877.0    2203.0     7630.0
         PRODUCT40       19.0      10.0      13.0      17.0       11.0
         PRODUCT47       41.0      37.0      49.0      51.0       34.0
         PRODUCT56       77.0      79.0      87.0     102.0       76.0
         PRODUCT57      123.0      81.0     116.0     133.0       81.0
         PRODUCT58      478.0     559.0     617.0     712.0     1099.0
         PRODUCT59    14906.0   15208.0   18014.0   18611.0    32511.0
         PRODUCT60      126.0      89.0      80.0     137.0       62.0
         PRODUCT62      187.0     119.0     199.0     196.0      130.0
A66      PRODUCT34      126.0     159.0     187.0     191.0      183.0
         PRODUCT58        4.0       2.0       3.0       2.0        0.0
         PRODUCT59     2513.0    4131.0    3133.0    5327.0     2069.0
A67      PRODUCT34      885.0     903.0     720.0     756.0     1241.0
         PRODUCT58       32.0      61.0      98.0     167.0       26.0
         PRODUCT59    20655.0   15305.0   15119.0   18917.0    21887.0
A68      PRODUCT34       38.0      36.0      37.0      30.0       49.0
         PRODUCT58        2.0       0.0       1.0       0.0        0.0
         PRODUCT59     2255.0    2051.0    2584.0    2155.0     2237.0
A69      PRODUCT34      210.0     235.0     253.0     232.0      405.0
         PRODUCT58        1.0       1.0       3.0       1.0        1.0
         PRODUCT59    14479.0   13823.0   10596.0   11765.0    17916.0
A70      PRODUCT34     1878.0    1719.0    2645.0    2257.0     1806.0
         PRODUCT58       59.0      28.0      47.0      49.0       56.0
         PRODUCT59    82654.0   72010.0   84632.0   85369.0    97324.0
A77      PRODUCT1      2920.0    3070.0    4222.0    4422.0     3671.0
         PRODUCT12     3574.0    4152.0    5086.0    5846.0     4933.0

yearweek              201652
regionid product
A00      PRODUCT34      22.0
         PRODUCT58      19.0
         PRODUCT59   33511.0
A01      PRODUCT1      599.0
         PRODUCT12  208186.0
         PRODUCT14   28969.0
         PRODUCT15    2902.0
         PRODUCT16    1832.0
         PRODUCT19    4293.0
         PRODUCT2    29640.0
         PRODUCT20      15.0
         PRODUCT33   21213.0
         PRODUCT34  349574.0
         PRODUCT4    44429.0
         PRODUCT47   11207.0
         PRODUCT56    8308.0
         PRODUCT57    4863.0
         PRODUCT58   60303.0
         PRODUCT59  813749.0
         PRODUCT6    21540.0
         PRODUCT60       1.0
         PRODUCT62   19507.0
         PRODUCT63   59716.0
         PRODUCT7     5945.0
         PRODUCT75   21950.0
         PRODUCT8       59.0
A02      PRODUCT1       66.0
         PRODUCT12   33237.0
         PRODUCT14    3610.0
         PRODUCT16     188.0
...                      ...
A65      PRODUCT1       18.0
         PRODUCT12    6704.0
         PRODUCT14      40.0
         PRODUCT33     386.0
         PRODUCT34    7161.0
         PRODUCT40      44.0
         PRODUCT47     242.0
         PRODUCT56     167.0
         PRODUCT57     378.0
         PRODUCT58     815.0
         PRODUCT59   25034.0
         PRODUCT60     204.0
         PRODUCT62     391.0
A66      PRODUCT34     138.0
         PRODUCT58       0.0
         PRODUCT59    2229.0
A67      PRODUCT34    1008.0
         PRODUCT58      16.0
         PRODUCT59   17639.0
A68      PRODUCT34      58.0
         PRODUCT58       0.0
         PRODUCT59    2673.0
A69      PRODUCT34     197.0
         PRODUCT58       2.0
         PRODUCT59   14097.0
A70      PRODUCT34    1479.0
         PRODUCT58      56.0
         PRODUCT59  100067.0
A77      PRODUCT1     2759.0
         PRODUCT12    7551.0

[794 rows x 157 columns]
       regionid    product yearweek      qty
0           A00  PRODUCT34   201401    661.0
1           A00  PRODUCT34   201402    679.0
2           A00  PRODUCT34   201403    578.0
3           A00  PRODUCT34   201404    532.0
4           A00  PRODUCT34   201405    516.0
5           A00  PRODUCT34   201406    423.0
6           A00  PRODUCT34   201407    407.0
7           A00  PRODUCT34   201408    364.0
8           A00  PRODUCT34   201409    470.0
9           A00  PRODUCT34   201410    538.0
10          A00  PRODUCT34   201411    369.0
11          A00  PRODUCT34   201412    352.0
12          A00  PRODUCT34   201413    354.0
13          A00  PRODUCT34   201414    312.0
14          A00  PRODUCT34   201415    295.0
15          A00  PRODUCT34   201416    284.0
16          A00  PRODUCT34   201417    237.0

  regionid    product yearweek    qty
0      A00  PRODUCT34   201401  661.0
1      A00  PRODUCT34   201402  679.0
2      A00  PRODUCT34   201403  578.0
3      A00  PRODUCT34   201404  532.0
4      A00  PRODUCT34   201405  516.0

In [281]:
unpivotResult=pivotResult.stack().reset_index()
unpivotResult.columns=\
['regionid','product','yearweek','qty']
print(unpivotResult)
unpivotResult.head()

       regionid    product yearweek      qty
0           A00  PRODUCT34   201401    661.0
1           A00  PRODUCT34   201402    679.0
2           A00  PRODUCT34   201403    578.0
3           A00  PRODUCT34   201404    532.0
4           A00  PRODUCT34   201405    516.0
5           A00  PRODUCT34   201406    423.0
6           A00  PRODUCT34   201407    407.0
7           A00  PRODUCT34   201408    364.0
8           A00  PRODUCT34   201409    470.0
9           A00  PRODUCT34   201410    538.0
10          A00  PRODUCT34   201411    369.0
11          A00  PRODUCT34   201412    352.0
12          A00  PRODUCT34   201413    354.0
13          A00  PRODUCT34   201414    312.0
14          A00  PRODUCT34   201415    295.0
15          A00  PRODUCT34   201416    284.0
16          A00  PRODUCT34   201417    237.0
17          A00  PRODUCT34   201418    180.0
18          A00  PRODUCT34   201419    161.0
19          A00  PRODUCT34   201420    140.0
20          A00  PRODUCT34   201421    116.0
21          A00  PRODUCT34   201422     98.0
22          A00  PRODUCT34   201423     83.0
23          A00  PRODUCT34   201424     71.0
24          A00  PRODUCT34   201425     65.0
25          A00  PRODUCT34   201426     60.0
26          A00  PRODUCT34   201427     82.0
27          A00  PRODUCT34   201428    151.0
28          A00  PRODUCT34   201429    274.0
29          A00  PRODUCT34   201430    532.0
...         ...        ...      ...      ...
124628      A77  PRODUCT12   201623   5348.0
124629      A77  PRODUCT12   201624   3275.0
124630      A77  PRODUCT12   201625   4158.0
124631      A77  PRODUCT12   201626   4815.0
124632      A77  PRODUCT12   201627   3002.0
124633      A77  PRODUCT12   201628   3319.0
124634      A77  PRODUCT12   201629   4200.0
124635      A77  PRODUCT12   201630   7120.0
124636      A77  PRODUCT12   201631   6345.0
124637      A77  PRODUCT12   201632   5863.0
124638      A77  PRODUCT12   201633   4211.0
124639      A77  PRODUCT12   201634   4019.0
124640      A77  PRODUCT12   201635   3624.0
124641      A77  PRODUCT12   201636   3742.0
124642      A77  PRODUCT12   201637   3002.0
124643      A77  PRODUCT12   201638   5583.0
124644      A77  PRODUCT12   201639  14734.0
124645      A77  PRODUCT12   201640   3603.0
124646      A77  PRODUCT12   201641   4010.0
124647      A77  PRODUCT12   201642   4292.0
124648      A77  PRODUCT12   201643   5760.0
124649      A77  PRODUCT12   201644   4109.0
124650      A77  PRODUCT12   201645   4506.0
124651      A77  PRODUCT12   201646   4255.0
124652      A77  PRODUCT12   201647   3574.0
124653      A77  PRODUCT12   201648   4152.0
124654      A77  PRODUCT12   201649   5086.0
124655      A77  PRODUCT12   201650   5846.0
124656      A77  PRODUCT12   201651   4933.0
124657      A77  PRODUCT12   201652   7551.0

[124658 rows x 4 columns]

  regionid    product yearweek    qty
0      A00  PRODUCT34   201401  661.0
1      A00  PRODUCT34   201402  679.0
2      A00  PRODUCT34   201403  578.0
3      A00  PRODUCT34   201404  532.0
4      A00  PRODUCT34   201405  516.0

### 마지막 데이터프레임 group by 제대로 활용하기

In [282]:
def sub_function(data):
    data["MA"] = data["VOLUME"].rolling(window = 5, center = True).mean()
    return data

In [283]:
groupRollingData = sortedData.groupby(["REGIONID","PRODUCTGROUP"]).apply(sub_function)

In [284]:
groupRollingData.head()

  REGIONID PRODUCTGROUP YEARWEEK    VOLUME        MA
0      A01       ST0001   201501  513598.0       NaN
1      A01       ST0001   201502  438251.0       NaN
2      A01       ST0001   201503  420290.0  462590.2
3      A01       ST0001   201504  458431.0  473953.0
4      A01       ST0001   201505  482381.0  510381.2